Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: explain the terms place and place identity, and assess the ways in which local, regional and global trends can affect places
nb: forklare begrepene sted og stedsidentitet og vurdere hvordan lokale, regionale og globale trender påvirker steder

source: Understanding, awareness and application of history
nb: handler om hvordan historie blir forstått og brukt av individer, grupper og samfunn.

source: In addition to learning the English language, this subject will also contribute insight into the way we live and how others live, and their views on life, values and cultures.
nb: Når vi er bevisste på strategier som brukes for å lære språk, og strategier som hjelper oss til å forstå og bli forstått, blir tilegnelsen av kunnskaper og ferdigheter enklere og mer meningsfylt.

source: recognise the devices of humour, irony, contrast, comparison, symbols and metaphors and use some of them in own texts
nb: gjenkjenne virkemidlene humor, ironi, kontraster, sammenligninger, symboler og språklige bilder og bruke noen av dem i egne tekster

source: show how texts in various genres can be constructed in various ways
nb: lese og skrive tekster i ulike sjangere, både skjønnlitterære- og sakspreget

source: understand and reflect on the relationship between speech and written language
nb: forstå og reflektere over forholdet mellom tale og skriftspråk

source: discuss content, form and purpose in a representative selection of contemporary texts, fiction and factual prose in the first-choice and second-choice Norwegian languages and in translation from the Sami language
nb: tolke og reflektere over innhold, form og formål i et representativt utvalg samtidstekster, skjønnlitteratur og sakprosa på bokmål og nynorsk og i oversettelse fra samisk

source: evaluate own texts and those created by others, and assess own texts by applying knowledge of language and text
nb: vurdere egne tekster og egen tekstskaping ved hjelp av kunnskap om språk og tekstlingvistikk

source: Moreover, English is increasingly used in education and working life, in Norway and abroad.
nb: I tillegg brukes engelsk i økende grad i utdanning og som arbeidsspråk i mange bedrifter.

source: Basic skills are something required at all levels, from the first school years until advanced higher education studies.
nb: Grunnleggende ferdigheter er noe man trenger på alle nivåer, fra de første årene i skolen til avanserte universitetsstudier.

source: Curriculum for the elective subject of Media and Information (MOI1-01)
nb: Læreplan i valgfaget medier og informasjon (MOI1-01)

source: present subject-related topics and discuss the material being presented
nb: diskutere og reflektere rundt det å tilhøre en språklig og kulturell minoritet

source: collect information from globes, maps and digital sources and use this to talk about places, people and languages
nb: bruke bilder, film og andre kilder for å fortelle om viktige landskap og landskapsformer i Sápmi/Sábme/Saepmie og Norge

source: Nature, environment and technology are also important subjects in the Norwegian Framework Plan.
nb: Også i den norske rammeplanen er natur, miljø og teknologi viktige fagområder.

source: in Landscaper and Sports Facilities Operator studies involves communicating, retrieving and exchanging information and performing calculations digitally.
nb: i anleggsgartner- og idrettsanleggsfag innebærer å kommunisere, hente og utveksle informasjon, utføre kalkulasjon og beregninger.

source: Competence aims after 1P-Y - Vg1 vocational education programme
nb: Kompetansemål etter 1P-Y – Vg1 yrkesfaglige utdanningsprogram

source: select tools and equipment, components and work methods based on standards and procedures
nb: velge verktøy og utstyr, komponenter og arbeidsmetoder ut fra standarder og prosedyrer

source: collect and process data and present and evaluate the results and conclusions of experiments and investigations, with and without digital tools
nb: samle inn og bearbeide data og presentere og vurdere resultater og konklusjoner av forsøk og undersøkelser, med og uten digitale verktøy

source: The first step need not necessarily be to agree.
nb: Det første steget må ikke nødvendigvis være å bli enige.

source: discuss and evaluate fiction texts on the basis of own experiences and with an understanding of the language and content
nb: drøfte og vurdere skjønnlitterære tekster med utgangspunkt i egne opplevelser og med forståelse for språk og innhold

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics and solve mathematical problems by using strategies, and by being creative, reasoning and reflecting.
nb: Læreren skal legge til rette for elevmedvirkning og stimulere til lærelyst ved at elevene får utforske matematikk og løse matematiske problemer gjennom å bruke strategier, være kreative, resonnere og reflektere.

source: Pupil participation involves taking part in decisions on one’s own and the group’s lear-ning.
nb: Elevmedvirkning innebærer deltakelse i beslutninger som gjelder egen og gruppens læring.

source: The grade awarded for coursework shall reflect the overall competence of the pupil in natural science after completing Year 10.
nb: Standpunktkarakteren skal være uttrykk for den samlede kompetansen eleven har i naturfag ved avslutningen av opplæringen etter 10.

source: Mapping out and discussing change processes are central themes of the main subject area, together with pondering the meaning of sustainable development.
nb: Kartlegging og diskusjon av endringsprosesser står sentralt, sammen med refleksjon rundt bærekraftig utvikling.

source: Both Sakshaug and Larsen are practice teachers.
nb: Både Sakshaug og Larsen er praksislærere.

source: in Landscaper and Sports Facilities Operator studies involves understanding simple tenders, specifications, operator manuals and relevant regulations.
nb: i anleggsgartner- og idrettsanleggsfag innebærer å forstå enkle anbudspapirer, beskrivelser, bruksanvisninger og gjeldende regelverk.

source: Christianity can not be selected in this main subject area.
nb: Kristendommen kan ikke velges i dette hovedområdet.

source: elaborate on and discuss the relationship between form, content and stylistic register in sentences and texts
nb: drøfte sammenhengen mellom form, innhold og stilnivå i setninger og tekster

source: In arts and crafts, the interdisciplinary topic of health and life skills addresses the development of creative thinking processes and practical problem-solving skills.
nb: I kunst og håndverk handler det tverrfaglige temaet folkehelse og livsmestring om at elevene utvikler evne til skapende tankeprosesser og praktisk problemløsing.

source: She has been an observer at three kindergartens in Norway.
nb: Hun har gjort observasjoner i tre barnehager i Norge.

source: Researcher Line Grønholt Olesen of the University of Southern Denmark studied a total of 426 children, ages 5 and 6, along with their parents and staff members from 43 randomly selected preschools.
nb: Forsker Line Grønholt Olesen ved Syddansk Universitet har studert i alt 426 barn i alderen 5-6 år, deres foreldre og personalet i 43 tilfeldig valgte barnehager.

source: introduce themselves, ask and answer questions related to their own person, family, actions, events and objects from their close surroundings
nb: presentere seg selv, stille og svare på spørsmål knyttet til egen person, familie, handlinger, hendelser og objekter i nære omgivelser

source: It includes communication with others and producing, composing and editing texts.
nb: Det omfatter kommunikasjon med andre og å produsere, komponere og redigere tekster.

source: The person suggests other solutions.
nb: utgangspunkt i fulltidsansatt, deltidsstilling og vikarer.

source: analyse, interpret and compare a selection of key Norwegian texts and some international texts from different literary traditions from the Romantic era until the present day and place them in a cultural-historical context
nb: analysere, tolke og sammenligne et utvalg sentrale norske og noen internasjonale tekster fra ulike litterære tradisjoner fra romantikken til i dag, og sette dem inn i en kulturhistorisk sammenheng

source: carry out art and design processes by seeking inspiration, exploring
nb: utforske menneskers handlingsrom og valgmuligheter i

source: The programme subject covers actual farmed species and the surrounding environment.
nb: Programfaget omfatter aktuelle oppdrettsarter og det omkringliggende miljøet.

source: Being able to assess one's own language use, define one's own needs and select strategies and ways of working are requirements for attaining this.
nb: Å kunne vurdere egen språkbruk, definere egne behov og velge strategier og arbeidsmåter er forutsetninger for å oppnå dette.

source: This involves learning to pinpoint and describe situations where mathematics is involved and using mathematical methods to deal with problems.
nb: Dette innebærer å gjenkjenne og beskrive situasjoner der matematikk inngår, og bruke matematiske metoder til å behandle problemstillinger.

source: Roughly 80 children from one to six years of age spend their days here, and they are offered settings adapted to their stage of development.
nb: De rundt 80 barna i alderen ett til seks år som går her, tilbys miljøer som er tilpasset deres fase i utviklingen.

source: The main subject area also covers attitudes and current ethical questions encountered by children and adolescents today in their local communities and in the world in which we live.
nb: Området omfatter også holdninger og aktuelle etiske problemstillinger i barns og unges liv, i lokalsamfunnet og i den globale verden.

source: use different situations, working methods and learning strategies to develop one’s English-language skills
nb: oversette tekster fra norsk til tegnspråk og fra tegnspråk til norsk og sammenlikne grammatiske hovedtrekk

source: in Chemistry involves the precise evaluation and presentation of one’s case in scientific discussions, as well as the planning and implementation of experiments and field trips.
nb: i kjemi innebærer å vurdere og argumentere presist i faglige diskusjoner, og ved planlegging og gjennomføring av forsøk og ekskursjoner.

source: adapt language and modes of expression to different writing situations at school, in society and at work
nb: tilpasse språk og uttrykksmåter til ulike skrivesituasjoner i skole, samfunn og arbeidsliv

source: read a selection of key Norwegian texts and some European texts from the Middle Ages to the Romantic era, place them in a cultural-historical context, and comment on their form and content
nb: lese et utvalg sentrale norske og noen europeiske tekster fra middelalderen til og med romantikken, sette dem inn i en kulturhistorisk sammenheng og kommentere form og innhold

source: The subject shall also give an insight into the political system in Norway and in the international community and make the individual aware that politics is a matter of conflict and collaboration.
nb: Faget skal gi innsikt i det politiske system i Norge, Sápmi/Sabme/Saepmie og i det internasjonale samfunnet og gjøre individet bevisst på at politikk er preget av konflikt og samarbeid.

source: She believes that some teachers may be afraid to initiate drama projects in kindergarten.
nb: Hun mener at noen barnehagelærere kan være redde for å sette i gang et dramaprosjekt i sin barnehage.

source: talk about and summarize the gist of puzzles, jokes or other humorous texts
nb: samtale om og gjengi innholdet i gåter, vitser eller andre humoristiske tekster

source: The various types of measures throughout society together limit the spread of infection.
nb: Det gjøres mange tiltak i alle deler av samfunnet som til sammen begrenser smittespredningen.

source: ‘The term comes from the business world, where one talks about entrepreneurship’, recounts the Swedish researcher Anna Ehrlin.
nb: Begrepet kommer fra forretningsverdenen der det snakkes om entreprenørskap, forteller den svenske forskeren Anna Ehrlin.

source: They have to learn to dress appropriately for being outdoors.
nb: De skal lære å kle seg godt for å være ute.

source: are both a core skill and a cultural competence.
nb: i norsk tegnspråk er både en grunnleggende ferdighet og en kulturell kompetanse.

source: interpret, make and use sketches and working drawings for problems from cultural and working life, and present these and provide rationale for one’s chosen solutions
nb: tolke, lage og bruke skisser og arbeidstegninger på problemstillinger fra kultur- og yrkesliv og presentere og begrunne løsninger

source: In Religion, Philosophies of life and Ethics (RLE), basic skills are understood as follows:
nb: I kristendoms-, religions- og livssynskunnskap forstås grunnleggende ferdigheter slik:

source: and resources and school facts.
nb: Norsk – Fag og språk (arbeidstittel)

source: use digital sources and tools to create composite texts with hyperlinks and a variety of aesthetic devices
nb: reflektere rundt og vurdere bruk av tegnspråk i medier og digitale informasjonskanaler

source: Religious, ethical and philosophical questions are important for each individual, and for society as a whole, both as the basis for who we are and as a source of conflict.
nb: Religiøse, etiske og filosofiske spørsmål berører den enkelte og samfunnet som helhet, både som grunnlag for felleskap og som kilde til splid.

source: ‘This is indeed crucial to be aware of here in Scandinavia, where it rains often’, concludes Olesen.
nb: – Dette er det faktisk viktig å være bevisst på her i Skandinavia, hvor det ofte regner, sier Olesen.

source: Online meetings are recommended on the red level.
nb: Dette skal være en del av skolens planarbeid.

source: give an account of and evaluate how Sign Language genres and variants are used by representatives of different groups and in different social settings
nb: beskrive og vurdere hvordan sjangere og språkvarianter i tegnspråk brukes av representanter for ulike grupper og i ulike sosiale sammenhenger

source: write simple texts and messages digitally and in functional handwriting
nb: skrive enkle tekster og beskjeder med funksjonell håndskrift og digitalt

source: She also interviewed employees and children in the kindergarten facilities.
nb: «Vi intervjuer folk i barnehagene for å se om kommunene gjør som de sier de gjør.

source: use numbers and variables in exploration, experimentation, practical and theoretical problem solving and technology and design projects
nb: bruke tall og variabler i utforskning, eksperimentering og praktisk og teoretisk problemløsning og i prosjekter med teknologi og design

source: This subject is a common core subject for upper secondary education programmes.
nb: Faget er et fellesfag for alle utdanningsprogrammene i videregående opplæring.

source: Kari Hoås Moen at Queen Maud University College of Early Childhood Education has studied the challenges for Norwegian kindergartens.
nb: Kari Hoås Moen ved Dronning Mauds Minne Høgskole for barnehagelærerutdanning har forsket på utfordringer for norske barnehager.

source: Because they often seem to be objective.
nb: De gir nemlig ofte et skinn av ­objektiv­itet.

source: Pupils may be selected for a text production exam in Sign Language.
nb: Eleven kan trekkes ut til eksamen i tekstskaping i tegnspråk.

source: Start with what is close by
nb: at det skal bli sett og bekreftet av den voksne.

source: In Item 3 the students were presented with two functions which had to be compared, while in Item 4 there is no clear hint that a graphics approach could be fruitful.
nb: i oppgave 3 blir elevene presentert for to funksjoner som skal sammenliknes, mens det i oppgave 4 ikke er noe tydelig ”hint” om at en grafisk framgangsmåte kan være fruktbar.

source: apply Stefan-Boltzmann’s law and Wien’s displacement law
nb: gjøre beregninger med Stefan-Boltzmanns lov og Wiens forskyvningslov

source: in Communication and culture involves mastering composite texts.
nb: i kommunikasjon og kultur innebærer å tilegne seg sammensatte tekster.

source: include support staff, substitutes and temporary employees when informing, as well as individuals
nb: vikarer og midlertidig ansatte i informasjonsformidlingen, samt personer i andre kommuner som er

source: make estimates of and measure length, area, volume, mass, temperature, time and angles and converse about the results and assess whether the result is reasonable or not
nb: gjøre overslag over og måle lengde, areal, volum, masse, temperatur, tid og vinkler, samtale om resultatene og vurdere om de er rimelige

source: The subject shall also provide them with knowledge of national and international institutions and agreements, including the effect international conventions have on the rights
nb: Utviklingen av skriveferdigheter i mat og helse går fra å kunne skrive enkle handlelister og korte sammensatte tekster til å kunne planlegge og utforme oppskrifter og menyer.

source: Pupils shall be helped, through the development of good learning strategies and insight into their own language learning, to develop their Norwegian language skills as quickly as possible.
nb: Det skal legges til rette for at elevene gjennom utvikling av gode læringsstrategier og innsikt i egen språklæring utvikler sine norskspråklige ferdigheter så raskt som mulig.

source: The teacher and pupils shall engage in dialogue about their development in programming and geometry.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i programmering og geometri.

source: These are catchwords for what the children in Sem Kindergarten learn by the time they reach school age’, comments Petra, the head teacher.
nb: Dette er stikkord for hva barna i Sem barnehage skal ha lært når de kommer på skolen, mener barnehagelederen Petra.

source: This includes the use and maintenance of equipment, tools, means of access, and instruments related to work at a fish farm.
nb: I dette inngår bruk og vedlikehold av utstyr, redskaper, framkomstmidler og instrumenter knyttet til arbeid på oppdrettsanlegg.

source: At OecD average (no statistically significant difference)
nb: motivasjonsfaktoren, og at yrkesretting er bra når det er relevant.

source: ✹ stimulate pupils and apprentices/trainees to develop their own learning
nb: ✹ stimulere elevene og lærlingene/lærekandidatene til å utvikle egne

source: Sandseter and research colleague Ole Johan Sando conducted a survey to map all accidents in Norwegian ECEC settings in 2012.
nb: Sandseter og forskerkollega Ole Johan Sando har i en studie kartlagt alle ulykker i norske barnehager i 2012.

source: locate and give an account of geographical information systems (GIS), and use GIS in their work with socio-geographical subjects
nb: finne fram til og gjøre rede for geografiske informasjonssystemer (GIS), og bruke GIS i arbeid med samfunnsgeografiske temaer

source: Schools play an essential role in the social and academic development of young people.
nb: Elever og ansatte kan komme tilbake ved negativ test og om de føler seg friske og feberfrie.

source: To develop the pupils’ social competence the school and apprenticeship-training enter-prise shall ensure that pupils are trained in various types of interaction and problem and conflict solving when working on their subjects and in the enterprise.
nb: For å utvikle elevenes sosiale kompetanse skal skolen og lærebedriften legge til rette for at de i arbeidet med fagene og i virksomheten el ers får øve seg i ulike former for samhandling og problem­ og konflikthåndtering.

source: The teacher and pupils shall engage in dialogue about their development in programming and understanding of numbers.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i programmering og tallforståelse.

source: choose and use different reading and writing strategies that are suitable for the purpose
nb: tolke og analysere helhet og nyanser i ulike sjangere og sammenhengen mellom innhold, virkemidler og hensikt

source: Minor conflicts between children are myriad in ECEC situations.
nb: Små konflikter mellom barna er det mange av i barnehagehverdagen.

source: Many respondents mentioned creative activities like drawing and painting.
nb: Mange deltakere nevnte kreative aktiviteter som tegning og maling.

source: “Well, we are little proud of this forest.
nb: – Vi er litt stolte av denne skogen.

source: She believes it is very important that pedagogical leaders not be drawn away from the units to do administrative work.
nb: Hun mener det er svært viktig at pedagogiske ledere ikke trekkes bort fra avdelingene og til administrative oppgaver.

source: In this way, the programme subject shall lead to greater insight into and understanding of the historic and philosophical background of those ideals and values that have characterized the development of culture and society.
nb: På denne måten skal programfaget bidra til å gi innsikt i og forståelse for den historiske og filosofiske bakgrunnen for idealer og verdier som har preget og preger utviklingen av kulturer og samfunn.

source: explain, discuss and elaborate on variations in living conditions in different regions of the world and compare and assess the large differences between rich and poor
nb: forklare og drøfte variasjoner i levekår i forskjellige deler av verden og sammenligne og vurdere de store forskjellene mellom fattige og rike

source: describe and talk about our senses and use them deliberately during indoor and outdoor activities
nb: beskrive og samtale om sansene og bruke dem bevisst ved aktiviteter ute og inne

source: It is very demanding to do research on viruses.
nb: Det er ganske krevende å forske på virus.

source: Marketing and management 2
nb: Markedsføring og ledelse 2

source: When children experience parental break-ups, kindergarten employees need to know how to help them.
nb: Når barn har opplevd samlivsbrudd, bør de ansatte i barnehagen vite hva de skal gjøre for å hjelpe dem.

source: different ways to convert, transport and store energy
nb: ulike måter å omdanne, transportere og lagre energi på

source: Geosciences X and geosciences 1
nb: Geofag X og geofag 1

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence to see relationships between different representations and problem solving strategies.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i å se sammenhenger mellom ulike representasjoner og problemløsingsstrategier.

source: more distance between students and staff (red level).
nb: barn og ansatte (rødt nivå).

source: It also covers text comprehension and text production within a variety of genres.
nb: I tillegg omfatter hovedområdet tekstforståelse og tekstproduksjon innen ulike sjangere.

source: in Marketing and management involves being able to present and substantiate professional themes and one's own work to small groups and large assemblies.
nb: i markedsføring og ledelse innebærer å kunne presentere og begrunne faglige temaer og egne arbeider i mindre grupper og i større forsamlinger.

source: knowledge helps provide insight for adults.
nb: kunnskap bidrar til å gi innsikt til voksne.

source: in RLE involves using spoken language to communicate and explain religions and philosophies of life, ethics and philosophy.
nb: i KRL innebærer å bruke talespråket til å kommunisere, forklare og forstå religioner og livssyn, etikk og filosofi.

source: plan and present trips to neighbouring places using maps and the internet
nb: planlegge og presentere reiser til andre områder i Sápmi/Sábme/Saepmie ved hjelp av kart og Internett
